jonvolk/DUAL_BMS_CCS/BMS_ALT.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
Dma.TIM2_CH1.0.MemInc=DMA_MINC_DISABLE
CAN1.NART=DISABLE
CAN2.TXFP=DISABLE
TIM2.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
RCC.CortexFreq_Value=72000000
FREERTOS.INCLUDE_xTaskGetSchedulerState=1
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F413RGTx
FREERTOS.configUSE_DAEMON_TASK_STARTUP_HOOK=0
CAN1.AWUM=DISABLE
Dma.TIM2_UP/CH3.2.Mode=DMA_NORMAL
CAN2.CalculateTimeBit=1999.99
Dma.TIM2_UP/CH3.2.MemDataAlignment=DMA_MDATAALIGN_WORD
RCC.PLLCLKFreq_Value=72000000
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
RCC.PLLQCLKFreq_Value=72000000
PC7.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_CAN1_Init-CAN1-false-HAL-true,5-MX_CAN2_Init-CAN2-false-HAL-true,6-MX_CAN3_Init-CAN3-false-HAL-true,7-MX_TIM2_Init-TIM2-false-HAL-true,8-MX_TIM3_Init-TIM3-false-HAL-true,9-MX_IWDG_Init-IWDG-false-HAL-true
Dma.TIM2_UP/CH3.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
FREERTOS.configTICK_RATE_HZ=1000
RCC.PLLI2SRCLKFreq_Value=96000000
Dma.TIM2_CH1.0.Instance=DMA1_Stream5
CAN3.NART=DISABLE
CAN3.AWUM=DISABLE
PC13.GPIO_Label=LED
PB13.Signal=CAN2_TX
FREERTOS.configUSE_TASK_NOTIFICATIONS=1
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
Dma.TIM2_CH2/CH4.1.Direction=DMA_MEMORY_TO_PERIPH
Mcu.IP4=FREERTOS
Mcu.IP5=IWDG
RCC.FCLKCortexFreq_Value=72000000
Mcu.IP2=CAN3
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=DMA
Mcu.IP0=CAN1
FREERTOS.configENABLE_FPU=0
Mcu.IP1=CAN2
FREERTOS.INCLUDE_pcTaskGetTaskName=0
Mcu.UserConstants=
PH0\ -\ OSC_IN.Signal=RCC_OSC_IN
SH.S_TIM3_CH2.ConfNb=1
Mcu.ThirdPartyNb=0
FREERTOS.configUSE_STATS_FORMATTING_FUNCTIONS=0
RCC.SDIOFreq_Value=72000000
RCC.HCLKFreq_Value=72000000
Mcu.IPNb=11
TIM2.IPParameters=Channel-Output Compare1 No Output,Channel-PWM Generation2 No Output,Prescaler,Period,Pulse-Output Compare1 No Output,Pulse-PWM Generation2 No Output
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=72000000
PC7.Signal=S_TIM3_CH2
RCC.SAI1BFreq_Value=16000000
RCC.PLLRoutputFreq_Value=72000000
Dma.TIM2_CH2/CH4.1.PeriphInc=DMA_PINC_DISABLE
FREERTOS.configUSE_MALLOC_FAILED_HOOK=0
Mcu.Pin6=PA1
FREERTOS.configQUEUE_REGISTRY_SIZE=8
Mcu.Pin7=PB12
Mcu.Pin8=PB13
Mcu.Pin9=PC6
FREERTOS.IPParameters=Tasks01,FootprintOK,configENABLE_FPU,configUSE_PREEMPTION,configTICK_RATE_HZ,configMINIMAL_STACK_SIZE,configMAX_TASK_NAME_LEN,configIDLE_SHOULD_YIELD,configUSE_MUTEXES,configUSE_RECURSIVE_MUTEXES,configUSE_COUNTING_SEMAPHORES,configQUEUE_REGISTRY_SIZE,configUSE_APPLICATION_TASK_TAG,configTOTAL_HEAP_SIZE,HEAP_NUMBER,configUSE_IDLE_HOOK,configUSE_TICK_HOOK,configUSE_MALLOC_FAILED_HOOK,configUSE_DAEMON_TASK_STARTUP_HOOK,configCHECK_FOR_STACK_OVERFLOW,configGENERATE_RUN_TIME_STATS,configUSE_TRACE_FACILITY,configUSE_STATS_FORMATTING_FUNCTIONS,configUSE_CO_ROUTINES,configMAX_CO_ROUTINE_PRIORITIES,configTIMER_TASK_PRIORITY,configTIMER_QUEUE_LENGTH,configTIMER_TASK_STACK_DEPTH,configLIBRARY_LOWEST_INTERRUPT_PRIORITY,configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY,INCLUDE_vTaskPrioritySet,INCLUDE_uxTaskPriorityGet,INCLUDE_vTaskDelete,INCLUDE_vTaskCleanUpResources,INCLUDE_vTaskSuspend,INCLUDE_vTaskDelayUntil,INCLUDE_vTaskDelay,INCLUDE_xTaskGetSchedulerState,INCLUDE_xTaskResumeFromISR,INCLUDE_xQueueGetMutexHolder,INCLUDE_xSemaphoreGetMutexHolder,INCLUDE_pcTaskGetTaskName,INCLUDE_uxTaskGetStackHighWaterMark,INCLUDE_xTaskGetCurrentTaskHandle,INCLUDE_eTaskGetState,INCLUDE_xEventGroupSetBitFromISR,INCLUDE_xTimerPendFunctionCall,configENABLE_BACKWARD_COMPATIBILITY,configUSE_TICKLESS_IDLE,configUSE_TASK_NOTIFICATIONS,INCLUDE_xTaskAbortDelay,INCLUDE_xTaskGetHandle,configRECORD_STACK_HIGH_ADDRESS,configUSE_NEWLIB_REENTRANT,copyHeapFile,INCLUDE_uxTaskGetStackHighWaterMark2,configUSE_POSIX_ERRNO
FREERTOS.configMINIMAL_STACK_SIZE=128
Dma.TIM2_UP/CH3.2.MemInc=DMA_MINC_DISABLE
RCC.AHBFreq_Value=72000000
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT
CAN3.BS2=CAN_BS2_3TQ
FREERTOS.configUSE_PREEMPTION=1
Mcu.Pin3=PH0 - OSC_IN
Mcu.Pin4=PH1 - OSC_OUT
Mcu.Pin5=PA0
CAN3.BS1=CAN_BS1_2TQ
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
VP_TIM2_VS_no_output1.Mode=Output Compare1 No Output
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB3.Mode=CAN_Activate
TIM2.Channel-PWM\ Generation2\ No\ Output=TIM_CHANNEL_2
Mcu.IP10=TIM3
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
CAN1.RFLM=DISABLE
FREERTOS.configENABLE_BACKWARD_COMPATIBILITY=1
RCC.DFSDM2Freq_Value=72000000
CAN3.TTCM=DISABLE
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.2
MxDb.Version=DB.6.0.10
PB4.Mode=CAN_Activate
CAN3.Prescaler=48
ProjectManager.BackupPrevious=false
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=2000000
FREERTOS.INCLUDE_xQueueGetMutexHolder=1
PA14.Mode=Serial_Wire
CAN2.Prescaler=12
FREERTOS.HEAP_NUMBER=4
TIM2.Pulse-Output\ Compare1\ No\ Output=8
CAN3.SJW=CAN_SJW_1TQ
Dma.TIM2_CH1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
NVIC.TIM2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
File.Version=6
CAN2.RFLM=DISABLE
CAN3.IPParameters=Prescaler,BS1,SJW,TTCM,ABOM,AWUM,NART,RFLM,TXFP,Mode,CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS2
PB8.Locked=true
RCC.PLLRCLKFreq_Value=72000000
FREERTOS.INCLUDE_vTaskCleanUpResources=0
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
CAN3.CalculateTimeQuantum=1333.3333333333335
Dma.TIM2_CH2/CH4.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
Dma.RequestsNb=3
FREERTOS.configTIMER_TASK_PRIORITY=2
ProjectManager.HalAssertFull=false
FREERTOS.configTOTAL_HEAP_SIZE=15360
CAN3.RFLM=DISABLE
VP_TIM2_VS_no_output2.Signal=TIM2_VS_no_output2
ProjectManager.ProjectName=BMS_ALT
PA0.Signal=GPIO_Input
RCC.MCO2PinFreq_Value=72000000
CAN1.Prescaler=48
PB9.Signal=CAN1_TX
Mcu.Package=LQFP64
TIM2.Prescaler=3-1
Dma.TIM2_CH1.0.FIFOMode=DMA_FIFOMODE_DISABLE
PB12.Mode=CAN_Activate
FREERTOS.configUSE_NEWLIB_REENTRANT=0
CAN1.TTCM=DISABLE
FREERTOS.INCLUDE_xTaskAbortDelay=0
NVIC.TimeBase=TIM7_IRQn
CAN2.BS1=CAN_BS1_2TQ
RCC.I2S2Freq_Value=96000000
CAN2.BS2=CAN_BS2_3TQ
Dma.TIM2_CH2/CH4.1.MemInc=DMA_MINC_ENABLE
FREERTOS.INCLUDE_vTaskSuspend=1
NVIC.CAN3_RX0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.SAI1AFreq_Value=16000000
Dma.TIM2_CH2/CH4.1.FIFOMode=DMA_FIFOMODE_DISABLE
ProjectManager.ToolChainLocation=
IWDG.Reload=1999
NVIC.TimeBaseIP=TIM7
FREERTOS.FootprintOK=true
FREERTOS.copyHeapFile=1
RCC.DFSDMFreq_Value=72000000
Dma.TIM2_CH1.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
FREERTOS.INCLUDE_vTaskPrioritySet=1
Dma.TIM2_CH2/CH4.1.Instance=DMA1_Stream6
Dma.Request2=TIM2_UP/CH3
Dma.Request1=TIM2_CH2/CH4
RCC.APB1TimFreq_Value=72000000
FREERTOS.configGENERATE_RUN_TIME_STATS=0
FREERTOS.configUSE_TICK_HOOK=0
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.DFSDM2AudioFreq_Value=96000000
PB13.Mode=CAN_Activate
RCC.DFSDMAudioFreq_Value=96000000
CAN2.TTCM=DISABLE
FREERTOS.configMAX_TASK_NAME_LEN=16
RCC.LPTimerFreq_Value=36000000
Dma.Request0=TIM2_CH1
NVIC.DMA1_Stream6_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
CAN1.CalculateTimeBit=7999.99
Dma.TIM2_CH1.0.Direction=DMA_MEMORY_TO_PERIPH
NVIC.TIM7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
ProjectManager.CustomerFirmwarePackage=
PB3.Locked=true
PB4.Signal=CAN3_TX
CAN1.CalculateTimeQuantum=1333.3333333333335
FREERTOS.INCLUDE_xTimerPendFunctionCall=1
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
FREERTOS.configTIMER_QUEUE_LENGTH=10
CAN2.CalculateBaudRate=500000
Dma.TIM2_UP/CH3.2.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.TIM2_UP/CH3.2.Priority=DMA_PRIORITY_HIGH
RCC.PLLQoutputFreq_Value=72000000
ProjectManager.ProjectFileName=BMS_ALT.ioc
FREERTOS.configIDLE_SHOULD_YIELD=1
CAN2.AWUM=DISABLE
FREERTOS.Tasks01=defaultTask,25,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL;synchCommand,24,128,StartsynchCommand,Default,NULL,Dynamic,NULL,NULL;balanceCommand,26,128,StartbalanceCommand,Default,NULL,Dynamic,NULL,NULL;processData,27,128,StartprocessData,Default,NULL,Dynamic,NULL,NULL;kickTheDog,48,128,StartkickTheDog,Default,NULL,Dynamic,NULL,NULL
CAN1.TXFP=DISABLE
Mcu.PinsNb=22
ProjectManager.NoMain=false
CAN2.NART=DISABLE
FREERTOS.INCLUDE_xTaskGetCurrentTaskHandle=0
PC13.Locked=true
FREERTOS.configLIBRARY_LOWEST_INTERRUPT_PRIORITY=15
NVIC.SavedSvcallIrqHandlerGenerated=true
PC13.Signal=GPIO_Output
VP_SYS_VS_tim7.Mode=TIM7
CAN1.IPParameters=Prescaler,BS1,SJW,TTCM,ABOM,AWUM,NART,RFLM,TXFP,Mode,CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS2
RCC.FMPI2C1Freq_Value=36000000
CAN2.SJW=CAN_SJW_1TQ
FREERTOS.INCLUDE_vTaskDelayUntil=1
FREERTOS.configCHECK_FOR_STACK_OVERFLOW=0
FREERTOS.configUSE_TICKLESS_IDLE=0
CAN1.CalculateBaudRate=125000
CAN2.IPParameters=Prescaler,BS1,SJW,TTCM,ABOM,AWUM,NART,RFLM,TXFP,Mode,CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS2
RCC.VCOI2SInputFreq_Value=1000000
PH1\ -\ OSC_OUT.Mode=HSE-External-Oscillator
PC6.Signal=S_TIM3_CH1
CAN3.TXFP=DISABLE
ProjectManager.DefaultFWLocation=true
Dma.TIM2_CH2/CH4.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
FREERTOS.INCLUDE_vTaskDelay=1
NVIC.DMA1_Stream1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
ProjectManager.DeletePrevious=true
Dma.TIM2_UP/CH3.2.PeriphInc=DMA_PINC_DISABLE
RCC.APB1CLKDivider=RCC_HCLK_DIV2
PC14-OSC32_IN.Signal=RCC_OSC32_IN
TIM2.Pulse-PWM\ Generation2\ No\ Output=17
Dma.TIM2_CH2/CH4.1.MemDataAlignment=DMA_MDATAALIGN_WORD
FREERTOS.configUSE_APPLICATION_TASK_TAG=0
NVIC.CAN2_RX1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.FamilyName=M
Dma.TIM2_CH2/CH4.1.Priority=DMA_PRIORITY_HIGH
FREERTOS.INCLUDE_uxTaskGetStackHighWaterMark=1
PA13.Signal=SYS_JTMS-SWDIO
FREERTOS.configUSE_IDLE_HOOK=0
FREERTOS.INCLUDE_vTaskDelete=1
PH0\ -\ OSC_IN.Mode=HSE-External-Oscillator
Dma.TIM2_UP/CH3.2.PeriphDataAlignment=DMA_PDATAALIGN_WORD
CAN1.BS2=CAN_BS2_3TQ
FREERTOS.configRECORD_STACK_HIGH_ADDRESS=0
CAN1.BS1=CAN_BS1_2TQ
ProjectManager.TargetToolchain=Makefile
NVIC.DMA1_Stream5_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
FREERTOS.configUSE_TRACE_FACILITY=1
FREERTOS.configTIMER_TASK_STACK_DEPTH=256
PC6.Locked=true
PB9.Mode=CAN_Activate
RCC.I2S1Freq_Value=96000000
PB9.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=72000000
Dma.TIM2_UP/CH3.2.Instance=DMA1_Stream1
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=GPIO_Input
CAN3.CalculateBaudRate=125000
VP_TIM2_VS_no_output1.Signal=TIM2_VS_no_output1
CAN1.ABOM=DISABLE
RCC.VCOI2SOutputFreq_Value=192000000
FREERTOS.configUSE_POSIX_ERRNO=0
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
PH1\ -\ OSC_OUT.Signal=RCC_OSC_OUT
board=custom
RCC.VCOOutputFreq_Value=144000000
ProjectManager.LastFirmware=true
VP_SYS_VS_tim7.Signal=SYS_VS_tim7
FREERTOS.INCLUDE_eTaskGetState=1
CAN3.CalculateTimeBit=7999.99
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=72000000
Dma.TIM2_CH1.0.Priority=DMA_PRIORITY_HIGH
MxCube.Version=6.1.1
PC13.GPIOParameters=GPIO_Label
CAN1.Mode=CAN_MODE_NORMAL
CAN2.Mode=CAN_MODE_NORMAL
RCC.RNGFreq_Value=72000000
FREERTOS.configUSE_CO_ROUTINES=0
CAN2.CalculateTimeQuantum=333.33333333333337
TIM3.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2
CAN2.ABOM=DISABLE
CAN3.Mode=CAN_MODE_NORMAL
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
FREERTOS.configUSE_MUTEXES=1
CAN3.ABOM=DISABLE
FREERTOS.INCLUDE_xEventGroupSetBitFromISR=0
TIM2.Period=29
FREERTOS.configMAX_CO_ROUTINE_PRIORITIES=2
FREERTOS.INCLUDE_uxTaskPriorityGet=1
PA13.Mode=Serial_Wire
VP_TIM2_VS_no_output2.Mode=PWM Generation2 No Output
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDM2AudioFreq_Value,DFSDM2Freq_Value,DFSDMAudioFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FMPI2C1Freq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2S1Freq_Value,I2S2Freq_Value,LPTimerFreq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLRoutputFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1AFreq_Value,SAI1BFreq_Value,SDIOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
Dma.TIM2_CH2/CH4.1.Mode=DMA_NORMAL
IWDG.IPParameters=Prescaler,Reload
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F413R(G-H)Tx
FREERTOS.INCLUDE_xTaskResumeFromISR=1
RCC.PLLI2SQCLKFreq_Value=96000000
FREERTOS.INCLUDE_xSemaphoreGetMutexHolder=0
NVIC.SavedPendsvIrqHandlerGenerated=true
FREERTOS.INCLUDE_uxTaskGetStackHighWaterMark2=0
ProjectManager.UnderRoot=false
Mcu.IP8=SYS
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
CAN1.SJW=CAN_SJW_1TQ
Mcu.IP9=TIM2
Mcu.IP6=NVIC
Mcu.IP7=RCC
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=CAN3_RX
RCC.SYSCLKFreq_VALUE=72000000
FREERTOS.configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY=5
Dma.TIM2_CH1.0.Mode=DMA_NORMAL
PA1.Locked=true
Mcu.Pin20=VP_TIM2_VS_no_output1
Mcu.Pin21=VP_TIM2_VS_no_output2
FREERTOS.configUSE_COUNTING_SEMAPHORES=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
Dma.TIM2_UP/CH3.2.Direction=DMA_MEMORY_TO_PERIPH
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
ProjectManager.CompilerOptimize=6
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
Dma.TIM2_CH1.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB8
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PB9
Mcu.Pin13=PB3
FREERTOS.INCLUDE_xTaskGetHandle=0
Mcu.Pin14=PB4
FREERTOS.configUSE_RECURSIVE_MUTEXES=1
Mcu.Pin19=VP_SYS_VS_tim7
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin18=VP_IWDG_VS_IWDG
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA13
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
Mcu.Pin12=PA14
RCC.PLLM=8
PB8.Mode=CAN_Activate
RCC.PLLN=72
Mcu.Pin10=PC7
IWDG.Prescaler=IWDG_PRESCALER_8
PB8.Signal=CAN1_RX
RCC.PWRFreq_Value=72000000
RCC.APB1Freq_Value=36000000
Dma.TIM2_CH1.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.DeviceId=STM32F413RGTx
PB12.Signal=CAN2_RX
ProjectManager.LibraryCopy=0
NVIC.CAN1_RX0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
